---
kind: method
id: M:Autodesk.Revit.DB.LinkConversionData.GetOptions
source: html/5e33338c-a6b7-fbf8-a008-1856a6cad273.htm
---
# Autodesk.Revit.DB.LinkConversionData.GetOptions Method

Extra information used during the creation of the Revit document.

## Syntax (C#)
```csharp
public IDictionary<string, string> GetOptions()
```

## Returns
The extra information used during the creation of the Revit document.